KunYi/nRF5_SDK_Thread/examples/multiprotocol/experimental/ble_zigbee_dynamic_color_light_bulb_thingy/zigbee_color_light.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 *
 * @defgroup zigbee_examples_ble_zigbee_color_light_bulb_thingy zigbee_color_light.c
 * @{
 * @ingroup zigbee_examples
 */
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "app_timer.h"
#include "zboss_api.h"
#include "zb_zcl_color_control.h"
#include "zb_error_handler.h"
#include "zigbee_color_light.h"

#define LIGHT_LOCATION_KITCHEN              0x1D
#define LIGHT_LOCATION_OFFICE               0x24

/* Basic cluster attributes initial values. */
#define BULB_INIT_BASIC_APP_VERSION         01                                  /**< Version of the application software (1 byte). */
#define BULB_INIT_BASIC_STACK_VERSION       10                                  /**< Version of the implementation of the ZigBee stack (1 byte). */
#define BULB_INIT_BASIC_HW_VERSION          11                                  /**< Version of the hardware of the device (1 byte). */
#define BULB_INIT_BASIC_MANUF_NAME          "Nordic Semiconductor"              /**< Manufacturer name (32 bytes). */
#define BULB_INIT_BASIC_MODEL_ID            "Color_Dimmable_Light_Bulb_v0.1"    /**< Model number assigned by manufacturer (32-bytes long string). */
#define BULB_INIT_BASIC_DATE_CODE           "20180718"                          /**< First 8 bytes specify the date of manufacturer of the device in ISO 8601 format (YYYYMMDD). Th rest (8 bytes) are manufacturer specific. */
#define BULB_INIT_BASIC_POWER_SOURCE        ZB_ZCL_BASIC_POWER_SOURCE_DC_SOURCE /**< Type of power sources available for the device. For possible values see section 3.2.2.2.8 of ZCL specification. */
#define BULB_INIT_BASIC_LOCATION_DESC       "Office desk"                       /**< Describes the physical location of the device (16 bytes). May be modified during commisioning process. */
#define BULB_INIT_BASIC_PH_ENV              LIGHT_LOCATION_OFFICE               /**< Describes the type of physical environment. For possible values see section 3.2.2.2.10 of ZCL specification. */
#define BULB_LED_VISIBLE_TRESHOLD           90                                  /**< Threshold for Blink effect. */
#define CHECK_VALUE_CHANGE_PERIOD           120                                 /**< Period of time [ms] to check if value of cluster is changing. */

extern void update_endpoint_led(zb_uint8_t ep, led_params_t * p_led_params);

/* Define nrf app timer to handle too quick cluster attribute value changes in zboss stack */
APP_TIMER_DEF(m_level_timer);
APP_TIMER_DEF(m_effect_timer);

/**@brief Function to convert hue_stauration to RGB color space.
 *
 * @param[IN]  hue          Hue value of color.
 * @param[IN]  saturation   Saturation value of color.
 * @param[IN]  brightness   Brightness value of color.
 * @param[OUT] p_led_params Pointer to structure containing parameters to write to LED characteristic
 */
static void convert_hsb_to_rgb(uint8_t hue, uint8_t saturation, uint8_t brightness, led_params_t * p_rgb)
{
    /* Check if p_leds_params is not NULL pointer */
    if (p_rgb == NULL)
    {
        NRF_LOG_INFO("Incorrect pointer to led params");
        return;
    }

    /* C, X, m are auxiliary variables */
    float C     = 0.0;
    float X     = 0.0;
    float m     = 0.0;
    /* Convertion HSB --> RGB */
    C = (brightness / 255.0f) * (saturation / 254.0f);
    X = (hue / 254.0f) * 6.0f;
    /* Casting in var X is necessary due to implementation of floating-point modulo_2 */
    /*lint -e653 */
    X = (X - (2 * (((uint8_t) X) / 2)));
    /*lint -restore */
    X -= 1.0f;
    X = C * (1.0f - ((X > 0.0f) ? (X) : (-1.0f * X)));
    m = (brightness / 255.0f) - C;

    /* Hue value is stored in range (0 - 255) instead of (0 - 360) degree */
    if (hue <= 42) /* hue < 60 degree */
    {
        p_rgb->r = (uint8_t)((C + m) * 255.0f);
        p_rgb->g = (uint8_t)((X + m) * 255.0f);
        p_rgb->b = (uint8_t)((0.0f + m) * 255.0f);
    }
    else if (hue <= 84)  /* hue < 120 degree */
    {
        p_rgb->r = (uint8_t)((X + m) * 255.0f);
        p_rgb->g = (uint8_t)((C + m) * 255.0f);
        p_rgb->b = (uint8_t)((0.0f + m) * 255.0f);
    }
    else if (hue <= 127) /* hue < 180 degree */
    {
        p_rgb->r = (uint8_t)((0.0f + m) * 255.0f);
        p_rgb->g = (uint8_t)((C + m) * 255.0f);
        p_rgb->b = (uint8_t)((X + m) * 255.0f);
    }
    else if (hue < 170)  /* hue < 240 degree */
    {
        p_rgb->r = (uint8_t)((0.0f + m) * 255.0f);
        p_rgb->g = (uint8_t)((X + m) * 255.0f);
        p_rgb->b = (uint8_t)((C + m) * 255.0f);
    }
    else if (hue <= 212) /* hue < 300 degree */
    {
        p_rgb->r = (uint8_t)((X + m) * 255.0f);
        p_rgb->g = (uint8_t)((0.0f + m) * 255.0f);
        p_rgb->b = (uint8_t)((C + m) * 255.0f);
    }
    else                /* hue < 360 degree */
    {
        p_rgb->r = (uint8_t)((C + m) * 255.0f);
        p_rgb->g = (uint8_t)((0.0f + m) * 255.0f);
        p_rgb->b = (uint8_t)((X + m) * 255.0f);
    }
}

