KunYi/nRF5_SDK_Thread/examples/multiprotocol/experimental/ble_zigbee_dynamic_color_light_bulb_thingy/zigbee_color_light.c
/**@brief Function for updating RGB color value.
 *
 * @param[IN] p_ep_dev_ctx pointer to endpoint device ctx.
 */
static void led_update_state(zb_color_light_ctx_t * p_light_ctx)
{
    convert_hsb_to_rgb(p_light_ctx->color_control_attr.set_color_info.current_hue,
                       p_light_ctx->color_control_attr.set_color_info.current_saturation,
                       p_light_ctx->level_control_attr.current_level,
                       &p_light_ctx->led_params);

    update_endpoint_led(p_light_ctx->ep_id, &p_light_ctx->led_params);
}

/**@brief Switch LED off.
 *
 * @param[IN] p_ep_dev_ctx pointer to endpoint device ctx.
 */
static void led_off(zb_color_light_ctx_t * p_light_ctx)
{
    p_light_ctx->led_params.r = 0;
    p_light_ctx->led_params.g = 0;
    p_light_ctx->led_params.b = 0;
    update_endpoint_led(p_light_ctx->ep_id, &p_light_ctx->led_params);
}

/**@brief Function for changing the hue of the light bulb.
 *
 * @param[IN] p_ep_dev_ctx  Pointer to endpoint device ctx.
 * @param[IN] new_hue       New value for hue.
 */
static void light_set_hue(zb_color_light_ctx_t * p_light_ctx, zb_uint8_t hue)
{
    NRF_LOG_INFO("Set color hue value: %i on endpoint: %hu", hue, p_light_ctx->ep_id);

    ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id,                                       
                         ZB_ZCL_CLUSTER_ID_COLOR_CONTROL,            
                         ZB_ZCL_CLUSTER_SERVER_ROLE,                 
                         ZB_ZCL_ATTR_COLOR_CONTROL_CURRENT_HUE_ID, 
                         &hue,
                         ZB_FALSE);                                  

    led_update_state(p_light_ctx);
}

/**@brief Function for changing the saturation of the light bulb.
 *
 * @param[IN] p_ep_dev_ctx   pointer to endpoint device ctx.
 * @param[IN] new_saturation new value for saturation.
 */
static void light_set_saturation(zb_color_light_ctx_t * p_light_ctx, zb_uint8_t saturation)
{
    NRF_LOG_INFO("Set color saturation value: %i on endpoint: %hu", saturation, p_light_ctx->ep_id);

    ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id,                                       
                         ZB_ZCL_CLUSTER_ID_COLOR_CONTROL,            
                         ZB_ZCL_CLUSTER_SERVER_ROLE,                 
                         ZB_ZCL_ATTR_COLOR_CONTROL_CURRENT_SATURATION_ID, 
                         &saturation,                                       
                         ZB_FALSE);                                  

    led_update_state(p_light_ctx);
}

/**@brief Function for setting the light bulb brightness.
 *
 * @param[IN] p_ep_dev_ctx Pointer to endpoint device ctx.
 * @param[IN] new_level    Light bulb brightness value.
 */
static void light_set_brightness(zb_color_light_ctx_t * p_light_ctx, zb_uint16_t level)
{
    NRF_LOG_INFO("Set level value: %i on endpoint: %hu", level, p_light_ctx->ep_id);

    ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id,                                       
                         ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL,            
                         ZB_ZCL_CLUSTER_SERVER_ROLE,                 
                         ZB_ZCL_ATTR_LEVEL_CONTROL_CURRENT_LEVEL_ID, 
                         (zb_uint8_t *)&level,                                       
                         ZB_FALSE);                                  

    if (level == 0)
    {
        zb_uint8_t value = ZB_FALSE;
        ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id, 
                             ZB_ZCL_CLUSTER_ID_ON_OFF,    
                             ZB_ZCL_CLUSTER_SERVER_ROLE,  
                             ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID,
                             &value,                        
                             ZB_FALSE);                   
    }
    else
    {
        zb_uint8_t value = ZB_TRUE;
        ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id, 
                             ZB_ZCL_CLUSTER_ID_ON_OFF,    
                             ZB_ZCL_CLUSTER_SERVER_ROLE,  
                             ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID,
                             &value,                        
                             ZB_FALSE);
    }

    led_update_state(p_light_ctx);
}

/**@brief Function for turning ON/OFF the light bulb.
 *
 * @param[IN] p_ep_dev_ctx Pointer to endpoint device ctx.
 * @param[IN] on           Boolean light bulb state.
 */
static void light_set_state(zb_color_light_ctx_t * p_light_ctx, zb_bool_t on)
{
    NRF_LOG_INFO("Set ON/OFF value: %i on endpoint: %hu", on, p_light_ctx->ep_id);

    ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id, 
                         ZB_ZCL_CLUSTER_ID_ON_OFF,    
                         ZB_ZCL_CLUSTER_SERVER_ROLE,  
                         ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID,
                         (zb_uint8_t *)&on,                        
                         ZB_FALSE);                   

    if (on)
    {
        light_set_brightness(p_light_ctx,
                             p_light_ctx->level_control_attr.current_level);
    }
    else
    {
        led_off(p_light_ctx);
    }
}

/**@brief Set level control value if stable.
 *
 * This function checks if level control attribute is stable. If so then
 * the LED value is updated. If not another check is scheduled.
 *
 * @param[IN]   context   Void pointer to context function is called with.
 *
 * @details Function is called with pointer to zb_color_light_ctx_t as argument.
 */
static void level_timer_handler(void * context)
{
    zb_color_light_ctx_t  * p_device         = (zb_color_light_ctx_t *)context;
    zb_uint8_t            * p_lvl_ctrl_value = &p_device->level_control_attr.current_level;

    if (p_device->prev_lvl_ctrl_value == *p_lvl_ctrl_value)
    {
        p_device->value_unstable = ZB_FALSE;
        light_set_brightness(p_device, *p_lvl_ctrl_value);
    }
    else
    {
        ret_code_t err_code;
        err_code = app_timer_start(m_level_timer,
                                   APP_TIMER_TICKS(CHECK_VALUE_CHANGE_PERIOD),
                                   context);
        APP_ERROR_CHECK(err_code);

