KunYi/nRF5_SDK_Thread/examples/multiprotocol/experimental/ble_zigbee_dynamic_color_light_bulb_thingy/zigbee_color_light.c
        p_device->prev_lvl_ctrl_value = *p_lvl_ctrl_value;
    }
}

/**@brief Function for initializing clusters attributes.
 *
 * @param[IN]   p_light_ctx   Pointer to structure with device_ctx.
 * @param[IN]   ep_id          Endpoint ID.
 */
static void clusters_attr_init(zb_color_light_ctx_t * p_light_ctx)
{
    /* Basic cluster attributes data */
    p_light_ctx->basic_attr.zcl_version   = ZB_ZCL_VERSION;
    p_light_ctx->basic_attr.app_version   = BULB_INIT_BASIC_APP_VERSION;
    p_light_ctx->basic_attr.stack_version = BULB_INIT_BASIC_STACK_VERSION;
    p_light_ctx->basic_attr.hw_version    = BULB_INIT_BASIC_HW_VERSION;

    /* Use ZB_ZCL_SET_STRING_VAL to set strings, because the first byte should
     * contain string length without trailing zero.
     *
     * For example "test" string wil be encoded as:
     *   [(0x4), 't', 'e', 's', 't']
     */
    ZB_ZCL_SET_STRING_VAL(p_light_ctx->basic_attr.mf_name,
                          BULB_INIT_BASIC_MANUF_NAME,
                          ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_MANUF_NAME));

    ZB_ZCL_SET_STRING_VAL(p_light_ctx->basic_attr.model_id,
                          BULB_INIT_BASIC_MODEL_ID,
                          ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_MODEL_ID));

    ZB_ZCL_SET_STRING_VAL(p_light_ctx->basic_attr.date_code,
                          BULB_INIT_BASIC_DATE_CODE,
                          ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_DATE_CODE));

    p_light_ctx->basic_attr.power_source = BULB_INIT_BASIC_POWER_SOURCE;

    ZB_ZCL_SET_STRING_VAL(p_light_ctx->basic_attr.location_id,
                          BULB_INIT_BASIC_LOCATION_DESC,
                          ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_LOCATION_DESC));


    p_light_ctx->basic_attr.ph_env = BULB_INIT_BASIC_PH_ENV;

    /* Identify cluster attributes data */
    p_light_ctx->identify_attr.identify_time       = ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE;

    /* On/Off cluster attributes data */
    p_light_ctx->on_off_attr.on_off                = (zb_bool_t)ZB_ZCL_ON_OFF_IS_ON;
    p_light_ctx->on_off_attr.global_scene_ctrl     = ZB_TRUE;
    p_light_ctx->on_off_attr.on_time               = 0;
    p_light_ctx->on_off_attr.off_wait_time         = 0;

    /* Level control cluster attributes data */
    p_light_ctx->level_control_attr.current_level  = ZB_ZCL_LEVEL_CONTROL_LEVEL_MAX_VALUE; // Set current level value to maximum
    p_light_ctx->level_control_attr.remaining_time = ZB_ZCL_LEVEL_CONTROL_REMAINING_TIME_DEFAULT_VALUE;

    ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id, 
                         ZB_ZCL_CLUSTER_ID_ON_OFF,    
                         ZB_ZCL_CLUSTER_SERVER_ROLE,  
                         ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID,
                         (zb_uint8_t *)&p_light_ctx->on_off_attr.on_off,                        
                         ZB_FALSE);                   

    ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id,                                       
                         ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL,            
                         ZB_ZCL_CLUSTER_SERVER_ROLE,                 
                         ZB_ZCL_ATTR_LEVEL_CONTROL_CURRENT_LEVEL_ID, 
                         (zb_uint8_t *)&p_light_ctx->level_control_attr.current_level,                                       
                         ZB_FALSE);                                  

    /* Color control cluster attributes data */
    zb_dev_color_ctrl_atrr_set_color_inf_t * p_color_info = &p_light_ctx->color_control_attr.set_color_info;
    p_color_info->current_hue         = ZB_ZCL_COLOR_CONTROL_HUE_RED;
    p_color_info->current_saturation  = ZB_ZCL_COLOR_CONTROL_CURRENT_SATURATION_MAX_VALUE;
    /* Set to use hue & saturation */
    p_color_info->color_mode          = ZB_ZCL_COLOR_CONTROL_COLOR_MODE_HUE_SATURATION;
    p_color_info->color_temperature   = ZB_ZCL_COLOR_CONTROL_COLOR_TEMPERATURE_DEF_VALUE;
    p_color_info->remaining_time      = ZB_ZCL_COLOR_CONTROL_REMAINING_TIME_MIN_VALUE;
    p_color_info->color_capabilities  = ZB_ZCL_COLOR_CONTROL_CAPABILITIES_HUE_SATURATION;
    /* According to ZCL spec 5.2.2.2.1.12 0x00 shall be set when CurrentHue and CurrentSaturation are used. */
    p_color_info->enhanced_color_mode = 0x00;
    /* According to 5.2.2.2.1.10 execute commands when device is off. */
    p_color_info->color_capabilities  = ZB_ZCL_COLOR_CONTROL_OPTIONS_EXECUTE_IF_OFF;
    /* According to ZCL spec 5.2.2.2.2 0xFF shall be set when specific value is unknown. */
    p_light_ctx->color_control_attr.set_defined_primaries_info.number_primaries = 0xff;
}

static void effect_timer_handler(void * context)
{
    zb_color_light_ctx_t * p_light_ctx = (zb_color_light_ctx_t *)context;
    zb_ret_t ret;

    ret = zb_color_light_do_identify_effect(p_light_ctx,
                                            ZB_ZCL_IDENTIFY_EFFECT_ID_STOP);
    UNUSED_RETURN_VALUE(ret);
}


zb_ret_t zb_color_light_do_identify_effect(zb_color_light_ctx_t * p_light_ctx,
                                           zb_uint8_t             effect_id)
{
    uint8_t      effect_time = 0; // in seconds, 0 for indefinite effect
    led_params_t led_params;
    ret_code_t   err_code = NRF_SUCCESS;

    NRF_LOG_INFO("Identify effect %d on ep %d", effect_id, p_light_ctx->ep_id);

    switch (effect_id)
    {
        case ZB_ZCL_IDENTIFY_EFFECT_ID_BLINK:
            if (p_light_ctx->led_params.mode == LED_MODE_CONSTANT)
            {
                // Current brightness may be set to a low level (below
                // BULB_LED_VISIBLE_TRESHOLD), so switching it off would not
                // produce a blink effect. If, so then switch on fully.
                if (p_light_ctx->led_params.r +
                    p_light_ctx->led_params.g +
                    p_light_ctx->led_params.b > BULB_LED_VISIBLE_TRESHOLD)
                {
                    led_params.r = 0x00;
                    led_params.g = 0x00;
                    led_params.b = 0x00;
                }
                else
                {
                    led_params.r = 0xFF;
                    led_params.g = 0xFF;
                    led_params.b = 0xFF;
                }
            }
            else
            {
                if (p_light_ctx->led_params.color > 0)
                {
                    led_params.r = 0x00;
                    led_params.g = 0x00;
                    led_params.b = 0x00;
                }
                else
                {
                    led_params.r = 0xFF;
                    led_params.g = 0xFF;
                    led_params.b = 0xFF;
                }
            }
            led_params.mode = LED_MODE_CONSTANT;
            effect_time = 1;
            break;

        case ZB_ZCL_IDENTIFY_EFFECT_ID_BREATHE:
            led_params.mode      = LED_MODE_BREATHING;
            led_params.color     = 0x02;
            led_params.intensity = 100;
            led_params.delay     = 50;
            break;

