KunYi/nRF5_SDK_Thread/examples/multiprotocol/experimental/ble_zigbee_dynamic_color_light_bulb_thingy/zigbee_color_light.c
        case ZB_ZCL_IDENTIFY_EFFECT_ID_OKAY:
            led_params.mode    = LED_MODE_CONSTANT;
            led_params.r       = 0x00;
            led_params.g       = 0xFF;
            led_params.b       = 0x00;
            effect_time        = 1;
            break;

        case ZB_ZCL_IDENTIFY_EFFECT_ID_CHANNEL_CHANGE:
            led_params.mode    = LED_MODE_CONSTANT;
            led_params.r       = 0xFF;
            led_params.g       = 0xA5;
            led_params.b       = 0x00;
            effect_time        = 8;
            break;

        case ZB_ZCL_IDENTIFY_EFFECT_ID_FINISH_EFFECT:
        case ZB_ZCL_IDENTIFY_EFFECT_ID_STOP:
            update_endpoint_led(p_light_ctx->ep_id,
                                &p_light_ctx->led_params);
            return RET_OK;

        default:
            return RET_INVALID_PARAMETER;
    }

    update_endpoint_led(p_light_ctx->ep_id, &led_params);

    if (effect_time > 0)
    {
        err_code = app_timer_start(m_effect_timer,
                                   APP_TIMER_TICKS(1000*effect_time),
                                   p_light_ctx);
    }


    return (err_code == NRF_SUCCESS ? RET_OK : RET_ERROR);
}

zb_ret_t zb_color_light_set_attribute(zb_color_light_ctx_t          * p_light_ctx,
                                      zb_zcl_set_attr_value_param_t * p_savp)
{
    zb_ret_t ret = RET_NOT_IMPLEMENTED;

    if (p_savp->cluster_id == ZB_ZCL_CLUSTER_ID_ON_OFF)
    {
        if (p_savp->attr_id == ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID)
        {
            uint8_t value = p_savp->values.data8;
            light_set_state(p_light_ctx, (zb_bool_t)value);
            ret = RET_OK;
            NRF_LOG_INFO("on/off attribute setting to %hd", value);
        }
    }
    else if (p_savp->cluster_id == ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL)
    {
        if (p_savp->attr_id == ZB_ZCL_ATTR_LEVEL_CONTROL_CURRENT_LEVEL_ID)
        {
            uint16_t value = p_savp->values.data16;
            light_set_brightness(p_light_ctx, value);
            ret = RET_OK;
            NRF_LOG_INFO("level control attribute setting to %hd", value);
        }
    }
    else if (p_savp->cluster_id == ZB_ZCL_CLUSTER_ID_COLOR_CONTROL)
    {
        if (p_light_ctx->color_control_attr.set_color_info.remaining_time <= 1)
        {
            uint16_t value = p_savp->values.data16;

            switch (p_savp->attr_id)
            {
                case ZB_ZCL_ATTR_COLOR_CONTROL_CURRENT_HUE_ID:
                    light_set_hue(p_light_ctx, value);
                    ret = RET_OK;
                    break;

                case ZB_ZCL_ATTR_COLOR_CONTROL_CURRENT_SATURATION_ID:
                    light_set_saturation(p_light_ctx, value);
                    ret = RET_OK;
                    break;

                default:
                    NRF_LOG_INFO("Unused attribute");
                    break;
            }
        }
    }
    else
    {
        /* Other clusters can be processed here */
        NRF_LOG_INFO("Unhandled cluster attribute id: %d", p_savp->cluster_id);
    }

    return ret;
}

zb_ret_t zb_color_light_set_level(zb_color_light_ctx_t * p_light_ctx, zb_uint8_t value)
{
    ret_code_t err_code = NRF_SUCCESS;

    NRF_LOG_INFO("Level control setting to %d", value);
    ZB_ZCL_SET_ATTRIBUTE(p_light_ctx->ep_id,                                       
                         ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL,            
                         ZB_ZCL_CLUSTER_SERVER_ROLE,                 
                         ZB_ZCL_ATTR_LEVEL_CONTROL_CURRENT_LEVEL_ID, 
                         (zb_uint8_t *)&value,                                       
                         ZB_FALSE);                                  

    if (p_light_ctx->value_debounce_time > 0)
    {
        if (p_light_ctx->value_unstable == ZB_FALSE)
        {
            err_code = app_timer_start(m_level_timer,
                                       APP_TIMER_TICKS(p_light_ctx->value_debounce_time),
                                       p_light_ctx);
            p_light_ctx->prev_lvl_ctrl_value = p_light_ctx->level_control_attr.current_level;
            p_light_ctx->value_unstable = ZB_TRUE;
        }
    }
    else
    {
        light_set_brightness(p_light_ctx, value);
    }

    return (err_code == NRF_SUCCESS ? RET_OK : RET_ERROR);
}

void zb_color_light_init_ctx(zb_color_light_ctx_t * p_light_ctx,
                             uint8_t                ep_id,
                             zb_callback_t          identify_cb)
{
    memset(p_light_ctx, 0, sizeof(zb_color_light_ctx_t));

    p_light_ctx->ep_id               = ep_id;
    p_light_ctx->value_unstable      = ZB_FALSE;
    p_light_ctx->value_debounce_time = CHECK_VALUE_CHANGE_PERIOD;
    p_light_ctx->led_params.mode     = LED_MODE_CONSTANT;

    clusters_attr_init(p_light_ctx);
    light_set_brightness(p_light_ctx, ZB_ZCL_LEVEL_CONTROL_LEVEL_MAX_VALUE);

    /* Register handlers to identify notifications */
    ZB_AF_SET_IDENTIFY_NOTIFICATION_HANDLER(p_light_ctx->ep_id, identify_cb);
}

void zb_color_light_init(void)
{
    // Create app timer for handling fast changing cluster attribute values
    uint32_t err_code;

    err_code = app_timer_create(&m_level_timer,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                level_timer_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_effect_timer,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                effect_timer_handler);
    APP_ERROR_CHECK(err_code);
}

/**
 * @}
 */
